/*использовать наследование
ID экземпляра.
Предусмотреть автоматическое и корректное заполнение полей класса
данными. Перегрузка операторов не обязательна, но желательна по усмотрению. Для хранения данных
использовать только один список/массив.

Создать классы для работы предприятия.
Сотрудник, Менеджер, Тестировщик, Разработчик, Администратор, Директор.
Добавить также список с информацией о производимых/произведенных товарах. Внутри должна храниться
информация о разработчике и менеджере. Добавить возможность изменять статус товара (в
разработке, производится, есть на складе, нет в наличии) администраторам. Также добавить
возможность ставить задачи на выполнение (по истечению времени задача считается
выполненной и соответственно, изменяется статус).*/

#include "product.h"
#include "task_time.h"
#include <iostream>

int main() {

    task_time task1;
    task1.new_time();
    std::thread t1(&task_time::countdown, &task1);
    t1.detach();


    std::cout << "Okey.";



    getchar();getchar();
    return 0;
}
